<template>
    <div>
        <swiper class="swiper" :options="swiperOption">
            <swiper-slide class="text">
                <div>
                    党的十八大以来，以习近平同志为核心的党中央坚持全面从严治党，党风政风为之一新，党内政治生态明显好转，但仍有极少数党员、干部弄虚作假，搞两面派、做两面人。“坚决反对搞两面派、做两面人”，党的十九大报告在反对做两面人问题上态度十分鲜明。坚定不移全面从严治党，需要认清两面人、警惕两面人、清除两面人，使党员、干部始终对党忠诚老实。这是旗帜鲜明讲政治的必然要求。

早在2000多年前，荀子就对两面人有过分析。他区分了“国宝、国器、国用、国妖”四类人：“口能言之，身能行之，国宝也。口不能言，身能行之，国器也。口能言之，身不能行，国用也。口言善，身行恶，国妖也。治国者敬其宝，爱其器，任其用，除其妖。”荀子所谓的“国妖”，实际上就是两面人。从古至今，两面人对国家发展危害极大。当前，两面人的主要表现是：白天一个面孔，晚上一个面孔；表面信仰马列，背后迷信“大师”；表面勤勤恳恳，背后吃喝玩乐；表面谋划发展，背后官商勾结；表面中规中矩，背后我行我素；表面任人唯贤，背后任人唯钱；表面五湖四海，背后拉帮结派。两面人口是心非、口言善而身行恶，给党和人民事业造成严重威胁，污染了党内政治生态。

我们党一向警惕党内两面派和两面人对党的危害。在革命战争年代，毛泽东同志曾批评两面人“当面不说，背后乱说；开会不说，会后乱说”“说的是马克思主义，行的是自由主义；对人是马克思主义，对己是自由主义。两样货色齐备，各有各的用处”。刘少奇同志则从共产党人的修养层面对两面人进行揭露：喜欢投机取巧，双方讨好，到处逢迎，看人看势说话，顺风转舵，毫无原则。这种人就像寓言中的蝙蝠一样，看哪一方面行时，他就投到哪一方面去。当前，坚定不移全面从严治党，就要把坚决反对做两面人提到加强党的政治建设的高度去认识和对待。

坚决反对做两面人，首先要把党的政治建设摆在首位。两面人是党的政治建设中面临的突出问题，需要从政治建设的高度进行认识和防范。全党要在思想上政治上行动上同以习近平同志为核心的党中央保持高度一致，坚决维护党中央权威和集中统一领导，严守党的政治纪律和政治规矩，做到令行禁止；增强党内政治生活的政治性、时代性、原则性、战斗性，营造风清气正的党内政治生态，让两面人无处可躲、无处可藏。其次要不断坚定理想信念。可以说，马克思主义的世界观、人生观、价值观在两面人那里是“三观尽毁”，面对利益之诱、五色之惑，他们早已忘掉了共产党人的初心和使命。坚定的理想信念是共产党人经受住各种风浪考验的“定海神针”。广大党员、干部要坚持用习近平新时代中国特色社会主义思想武装头脑，牢记党的宗旨，挺起共产党人的精神脊梁，解决好世界观、人生观、价值观这个“总开关”问题。再次要不断完善制度机制。健全和完善干部考核标准，加大群众意见在考核中的权重。衡量干部政绩要看实绩，看人民群众的获得感幸福感安全感，而不能仅仅看干部自己怎么说。健全党和国家监督体系，强化自上而下的组织监督，改进自下而上的民主监督，发挥同级相互监督作用，加强对党员领导干部的日常管理监督，让两面人不能得利、无处遁形。
                </div>
            </swiper-slide>
        </swiper>
    </div>
</template>

<script>
    import 'swiper/dist/css/swiper.css'
    import {swiper ,swiperSlide} from 'vue-awesome-swiper'
    export default {
        data() {
            return {
                swiperOption: {
                    direction:'vertical',
                    slidesPerView:'auto',
                    freeMode:true,
                    mousewheel:true
                }
            }
        },
        components:{swiper,swiperSlide}
    }
</script>

<style scoped>
    .swiper{
        height: 300px;
        overflow: hidden;
    }
    .text{
        font-size: 10px;
        text-align: center;
        padding: 30px;
        height: auto;
        -webkit-box-sizing: border-box;
        box-sizing: border-box;
    }
</style>